<a href="https://colab.research.google.com/github/nithyashree66/Python/blob/main/connecting_to_sql_using_python.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

SQLITE library is used to connect to the database without a server.

In [1]:
import sqlite3 as sq

In [3]:
#create a database
database = sq.connect("student.db")
print("created successfully")

created successfully

In [7]:
#create table
database.execute('''CREATE TABLE students
                (id int,
                name char(50),
                age int,
                address char(50),
                dept char(50)
                );''')

print("table created successfully")

table created successfully

In [8]:
#insert data into the table

database.execute("INSERT INTO STUDENTS (id,name,age,address,dept) values (1,'pooja','20','kerala','cse')");

In [9]:
database.execute("INSERT INTO STUDENTS (id,name,age,address,dept) values (2,'nithyashree','20','chennai','cse')");

In [10]:
database.execute("INSERT INTO STUDENTS (id,name,age,address,dept) values (3,'shreya','20','trichy','ice')");

In [11]:
database.execute("INSERT INTO STUDENTS (id,name,age,address,dept) values (4,'avanti','20','chennai','bsw')");

In [12]:
database.execute("INSERT INTO STUDENTS (id,name,age,address,dept) values (5,'joesph','40','trichy','mbbs')");

In [13]:
database.commit()
print("inserted successfully")

inserted successfully

In [14]:
#selecting data from table
data = database.execute("SELECT * FROM STUDENTS;")
for i in data:
  print(i)

(1, 'pooja', 20, 'kerala', 'cse')
(2, 'nithyashree', 20, 'chennai', 'cse')
(3, 'shreya', 20, 'trichy', 'ice')
(4, 'avanti', 20, 'chennai', 'bsw')
(5, 'joesph', 40, 'trichy', 'mbbs')

In [15]:
#updating the data

database.execute("UPDATE STUDENTS set dept = 'AI' where id=5")

In [16]:
data = database.execute("SELECT * FROM STUDENTS;")
for i in data:
  print(i)

(1, 'pooja', 20, 'kerala', 'cse')
(2, 'nithyashree', 20, 'chennai', 'cse')
(3, 'shreya', 20, 'trichy', 'ice')
(4, 'avanti', 20, 'chennai', 'bsw')
(5, 'joesph', 40, 'trichy', 'AI')

In [17]:
#delete data

database.execute("DELETE FROM STUDENTS where id = 5;")

In [18]:
data = database.execute("SELECT * FROM STUDENTS;")
for i in data:
  print(i)

database.commit()
print("operation successful")

(1, 'pooja', 20, 'kerala', 'cse')
(2, 'nithyashree', 20, 'chennai', 'cse')
(3, 'shreya', 20, 'trichy', 'ice')
(4, 'avanti', 20, 'chennai', 'bsw')
operation successful